/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align> {
    storage: Storage,
    align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]

#[derive(Debug, Copy, Clone)]
pub struct blpapi_EventQueue {
    _unused: [u8; 0],
}
pub type blpapi_EventQueue_t = blpapi_EventQueue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_MessageIterator {
    _unused: [u8; 0],
}
pub type blpapi_MessageIterator_t = blpapi_MessageIterator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Name {
    _unused: [u8; 0],
}
pub type blpapi_Name_t = blpapi_Name;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Operation {
    _unused: [u8; 0],
}
pub type blpapi_Operation_t = blpapi_Operation;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_ProviderSession {
    _unused: [u8; 0],
}
pub type blpapi_ProviderSession_t = blpapi_ProviderSession;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_RequestTemplate {
    _unused: [u8; 0],
}
pub type blpapi_RequestTemplate_t = blpapi_RequestTemplate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Service {
    _unused: [u8; 0],
}
pub type blpapi_Service_t = blpapi_Service;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Session {
    _unused: [u8; 0],
}
pub type blpapi_Session_t = blpapi_Session;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_SessionOptions {
    _unused: [u8; 0],
}
pub type blpapi_SessionOptions_t = blpapi_SessionOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_TlsOptions {
    _unused: [u8; 0],
}
pub type blpapi_TlsOptions_t = blpapi_TlsOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_SubscriptionItrerator {
    _unused: [u8; 0],
}
pub type blpapi_SubscriptionIterator_t = blpapi_SubscriptionItrerator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Identity {
    _unused: [u8; 0],
}
pub type blpapi_UserHandle = blpapi_Identity;
pub type blpapi_UserHandle_t = blpapi_Identity;
pub type blpapi_Identity_t = blpapi_Identity;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize);
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type blpapi_ManagedPtr_t = blpapi_ManagedPtr_t_;
pub type blpapi_ManagedPtr_ManagerFunction_t = ::std::option::Option<
    unsafe extern "C" fn(
        managedPtr: *mut blpapi_ManagedPtr_t,
        srcPtr: *const blpapi_ManagedPtr_t,
        operation: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub union blpapi_ManagedPtr_t_data_ {
    pub intValue: ::std::os::raw::c_int,
    pub ptr: *mut ::std::os::raw::c_void,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_blpapi_ManagedPtr_t_data_() {
    assert_eq!(
        ::std::mem::size_of::<blpapi_ManagedPtr_t_data_>(),
        8usize,
        concat!("Size of: ", stringify!(blpapi_ManagedPtr_t_data_))
    );
    assert_eq!(
        ::std::mem::align_of::<blpapi_ManagedPtr_t_data_>(),
        8usize,
        concat!("Alignment of ", stringify!(blpapi_ManagedPtr_t_data_))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<blpapi_ManagedPtr_t_data_>())).intValue as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_ManagedPtr_t_data_),
            "::",
            stringify!(intValue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_ManagedPtr_t_data_>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_ManagedPtr_t_data_),
            "::",
            stringify!(ptr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct blpapi_ManagedPtr_t_ {
    pub pointer: *mut ::std::os::raw::c_void,
    pub userData: [blpapi_ManagedPtr_t_data_; 4usize],
    pub manager: blpapi_ManagedPtr_ManagerFunction_t,
}
#[test]
fn bindgen_test_layout_blpapi_ManagedPtr_t_() {
    assert_eq!(
        ::std::mem::size_of::<blpapi_ManagedPtr_t_>(),
        48usize,
        concat!("Size of: ", stringify!(blpapi_ManagedPtr_t_))
    );
    assert_eq!(
        ::std::mem::align_of::<blpapi_ManagedPtr_t_>(),
        8usize,
        concat!("Alignment of ", stringify!(blpapi_ManagedPtr_t_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_ManagedPtr_t_>())).pointer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_ManagedPtr_t_),
            "::",
            stringify!(pointer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_ManagedPtr_t_>())).userData as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_ManagedPtr_t_),
            "::",
            stringify!(userData)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_ManagedPtr_t_>())).manager as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_ManagedPtr_t_),
            "::",
            stringify!(manager)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct blpapi_CorrelationId_t_ {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub value: blpapi_CorrelationId_t___bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union blpapi_CorrelationId_t___bindgen_ty_1 {
    pub intValue: blpapi_UInt64_t,
    pub ptrValue: blpapi_ManagedPtr_t,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_blpapi_CorrelationId_t___bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<blpapi_CorrelationId_t___bindgen_ty_1>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(blpapi_CorrelationId_t___bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<blpapi_CorrelationId_t___bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(blpapi_CorrelationId_t___bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<blpapi_CorrelationId_t___bindgen_ty_1>())).intValue as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_CorrelationId_t___bindgen_ty_1),
            "::",
            stringify!(intValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<blpapi_CorrelationId_t___bindgen_ty_1>())).ptrValue as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_CorrelationId_t___bindgen_ty_1),
            "::",
            stringify!(ptrValue)
        )
    );
}
#[test]
fn bindgen_test_layout_blpapi_CorrelationId_t_() {
    assert_eq!(
        ::std::mem::size_of::<blpapi_CorrelationId_t_>(),
        56usize,
        concat!("Size of: ", stringify!(blpapi_CorrelationId_t_))
    );
    assert_eq!(
        ::std::mem::align_of::<blpapi_CorrelationId_t_>(),
        8usize,
        concat!("Alignment of ", stringify!(blpapi_CorrelationId_t_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_CorrelationId_t_>())).value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_CorrelationId_t_),
            "::",
            stringify!(value)
        )
    );
}
impl blpapi_CorrelationId_t_ {
    #[inline]
    pub fn size(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_size(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn valueType(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_valueType(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn classId(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_classId(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(28usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(28usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        size: ::std::os::raw::c_uint,
        valueType: ::std::os::raw::c_uint,
        classId: ::std::os::raw::c_uint,
        reserved: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let size: u32 = unsafe { ::std::mem::transmute(size) };
            size as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let valueType: u32 = unsafe { ::std::mem::transmute(valueType) };
            valueType as u64
        });
        __bindgen_bitfield_unit.set(12usize, 16u8, {
            let classId: u32 = unsafe { ::std::mem::transmute(classId) };
            classId as u64
        });
        __bindgen_bitfield_unit.set(28usize, 4u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type blpapi_CorrelationId_t = blpapi_CorrelationId_t_;
pub type max_align_t = f64;
extern "C" {
    pub fn blpapi_Name_create(nameString: *const ::std::os::raw::c_char) -> *mut blpapi_Name_t;
}
extern "C" {
    pub fn blpapi_Name_destroy(name: *mut blpapi_Name_t);
}
extern "C" {
    pub fn blpapi_Name_duplicate(src: *const blpapi_Name_t) -> *mut blpapi_Name_t;
}
extern "C" {
    pub fn blpapi_Name_equalsStr(
        name: *const blpapi_Name_t,
        string: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn blpapi_Name_string(name: *const blpapi_Name_t) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn blpapi_Name_length(name: *const blpapi_Name_t) -> usize;
}
extern "C" {
    pub fn blpapi_Name_findName(nameString: *const ::std::os::raw::c_char) -> *mut blpapi_Name_t;
}
extern "C" {
    pub fn blpapi_getLastErrorDescription(
        resultCode: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct blpapi_ErrorInfo {
    pub exceptionClass: ::std::os::raw::c_int,
    pub description: [::std::os::raw::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_blpapi_ErrorInfo() {
    assert_eq!(
        ::std::mem::size_of::<blpapi_ErrorInfo>(),
        260usize,
        concat!("Size of: ", stringify!(blpapi_ErrorInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<blpapi_ErrorInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(blpapi_ErrorInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_ErrorInfo>())).exceptionClass as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_ErrorInfo),
            "::",
            stringify!(exceptionClass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_ErrorInfo>())).description as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_ErrorInfo),
            "::",
            stringify!(description)
        )
    );
}
pub type blpapi_ErrorInfo_t = blpapi_ErrorInfo;
extern "C" {
    pub fn blpapi_getErrorInfo(
        buffer: *mut blpapi_ErrorInfo_t,
        errorCode: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type blpapi_StreamWriter_t = ::std::option::Option<
    unsafe extern "C" fn(
        data: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
        stream: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_TimePoint {
    pub d_value: blpapi_Int64_t,
}
#[test]
fn bindgen_test_layout_blpapi_TimePoint() {
    assert_eq!(
        ::std::mem::size_of::<blpapi_TimePoint>(),
        8usize,
        concat!("Size of: ", stringify!(blpapi_TimePoint))
    );
    assert_eq!(
        ::std::mem::align_of::<blpapi_TimePoint>(),
        8usize,
        concat!("Alignment of ", stringify!(blpapi_TimePoint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_TimePoint>())).d_value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_TimePoint),
            "::",
            stringify!(d_value)
        )
    );
}
pub type blpapi_TimePoint_t = blpapi_TimePoint;
extern "C" {
    pub fn blpapi_TimePointUtil_nanosecondsBetween(
        start: *const blpapi_TimePoint_t,
        end: *const blpapi_TimePoint_t,
    ) -> ::std::os::raw::c_longlong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Datetime_tag {
    pub parts: blpapi_UChar_t,
    pub hours: blpapi_UChar_t,
    pub minutes: blpapi_UChar_t,
    pub seconds: blpapi_UChar_t,
    pub milliSeconds: blpapi_UInt16_t,
    pub month: blpapi_UChar_t,
    pub day: blpapi_UChar_t,
    pub year: blpapi_UInt16_t,
    pub offset: blpapi_Int16_t,
}
#[test]
fn bindgen_test_layout_blpapi_Datetime_tag() {
    assert_eq!(
        ::std::mem::size_of::<blpapi_Datetime_tag>(),
        12usize,
        concat!("Size of: ", stringify!(blpapi_Datetime_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<blpapi_Datetime_tag>(),
        2usize,
        concat!("Alignment of ", stringify!(blpapi_Datetime_tag))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_Datetime_tag>())).parts as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_Datetime_tag),
            "::",
            stringify!(parts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_Datetime_tag>())).hours as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_Datetime_tag),
            "::",
            stringify!(hours)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_Datetime_tag>())).minutes as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_Datetime_tag),
            "::",
            stringify!(minutes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_Datetime_tag>())).seconds as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_Datetime_tag),
            "::",
            stringify!(seconds)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<blpapi_Datetime_tag>())).milliSeconds as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_Datetime_tag),
            "::",
            stringify!(milliSeconds)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_Datetime_tag>())).month as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_Datetime_tag),
            "::",
            stringify!(month)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_Datetime_tag>())).day as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_Datetime_tag),
            "::",
            stringify!(day)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_Datetime_tag>())).year as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_Datetime_tag),
            "::",
            stringify!(year)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blpapi_Datetime_tag>())).offset as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_Datetime_tag),
            "::",
            stringify!(offset)
        )
    );
}
pub type blpapi_Datetime_t = blpapi_Datetime_tag;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_HighPrecisionDatetime_tag {
    pub datetime: blpapi_Datetime_t,
    pub picoseconds: blpapi_UInt32_t,
}
#[test]
fn bindgen_test_layout_blpapi_HighPrecisionDatetime_tag() {
    assert_eq!(
        ::std::mem::size_of::<blpapi_HighPrecisionDatetime_tag>(),
        16usize,
        concat!("Size of: ", stringify!(blpapi_HighPrecisionDatetime_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<blpapi_HighPrecisionDatetime_tag>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(blpapi_HighPrecisionDatetime_tag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<blpapi_HighPrecisionDatetime_tag>())).datetime as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_HighPrecisionDatetime_tag),
            "::",
            stringify!(datetime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<blpapi_HighPrecisionDatetime_tag>())).picoseconds as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(blpapi_HighPrecisionDatetime_tag),
            "::",
            stringify!(picoseconds)
        )
    );
}
pub type blpapi_HighPrecisionDatetime_t = blpapi_HighPrecisionDatetime_tag;
extern "C" {
    pub fn blpapi_Datetime_compare(
        lhs: blpapi_Datetime_t,
        rhs: blpapi_Datetime_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn blpapi_Datetime_print(
        datetime: *const blpapi_Datetime_t,
        streamWriter: blpapi_StreamWriter_t,
        stream: *mut ::std::os::raw::c_void,
        level: ::std::os::raw::c_int,
        spacesPerLevel: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn blpapi_HighPrecisionDatetime_compare(
        lhs: *const blpapi_HighPrecisionDatetime_t,
        rhs: *const blpapi_HighPrecisionDatetime_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn blpapi_HighPrecisionDatetime_print(
        datetime: *const blpapi_HighPrecisionDatetime_t,
